### TF Part # 1
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`

  <details><summary>Show Plan</summary>

  ```

  [command]/home/runner/work/_temp/de7dab10-ea69-470e-b771-db4cfa3f04ac/terraform-bin show -no-color tf.plan
2023-08-08T14:21:28.113Z [INFO]  Terraform version: 1.5.4
2023-08-08T14:21:28.113Z [INFO]  Go runtime version: go1.20
2023-08-08T14:21:28.113Z [INFO]  CLI args: []string{"/home/runner/work/_temp/de7dab10-ea69-470e-b771-db4cfa3f04ac/terraform-bin", "show", "-no-color", "tf.plan"}
2023-08-08T14:21:28.114Z [INFO]  CLI command args: []string{"show", "-no-color", "tf.plan"}
2023-08-08T14:21:28.459Z [INFO]  provider: configuring client automatic mTLS
2023-08-08T14:21:28.609Z [INFO]  provider.terraform-provider-google_v4.73.0_x5: configuring server automatic mTLS: timestamp=2023-08-08T14:21:28.609Z

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.default-allow-icmp will be created
  + resource "google_compute_firewall" "default-allow-icmp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "default-allow-icmp-tcp"
      + network            = "default"
      + priority           = 1000
      + project            = "advizir-dev"
      + self_link          = (known after apply)
      + source_tags        = [
          + "web",
        ]

      + allow {
          + ports    = [
              + "80",
              + "8080",
              + "1000-2000",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_compute_firewall.default-allow-icmp will be created%0A  + resource "google_compute_firewall" "default-allow-icmp" {%0A      + creation_timestamp = (known after apply)%0A      + destination_ranges = (known after apply)%0A      + direction          = (known after apply)%0A      + enable_logging     = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "default-allow-icmp-tcp"%0A      + network            = "default"%0A      + priority           = 1000%0A      + project            = "advizir-dev"%0A      + self_link          = (known after apply)%0A      + source_tags        = [%0A          + "web",%0A        ]%0A%0A      + allow {%0A          + ports    = [%0A              + "80",%0A              + "8080",%0A              + "1000-2000",%0A            ]%0A          + protocol = "tcp"%0A        }%0A      + allow {%0A          + ports    = []%0A          + protocol = "icmp"%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 2023-08-08T14:21:28.113Z [INFO]  Terraform version: 1.5.4%0A2023-08-08T14:21:28.113Z [INFO]  Go runtime version: go1.20%0A2023-08-08T14:21:28.113Z [INFO]  CLI args: []string{"/home/runner/work/_temp/de7dab10-ea69-470e-b771-db4cfa3f04ac/terraform-bin", "show", "-no-color", "tf.plan"}%0A2023-08-08T14:21:28.114Z [INFO]  CLI command args: []string{"show", "-no-color", "tf.plan"}%0A2023-08-08T14:21:28.459Z [INFO]  provider: configuring client automatic mTLS%0A2023-08-08T14:21:28.609Z [INFO]  provider.terraform-provider-google_v4.73.0_x5: configuring server automatic mTLS: timestamp=2023-08-08T14:21:28.609Z%0A
::debug::exitcode: 0

  ```

  </details>

  *Pusher: @misrarm, Action: `pull_request`, Workflow: `[TF] Applying Infra Changes`*